Revit 2027 API
ViewPlan.CheckPlanViewRangeValidity Method
 Checks if the plan view range is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<PlanViewRangeError> CheckPlanViewRangeValidity(
	PlanViewRange planViewRange
)
Public Function CheckPlanViewRangeValidity (
	planViewRange As PlanViewRange
) As IList(Of PlanViewRangeError)
public:
IList<PlanViewRangeError>^ CheckPlanViewRangeValidity(
	PlanViewRange^ planViewRange
)
member CheckPlanViewRangeValidity :
        planViewRange : PlanViewRange -> IList<PlanViewRangeError>
Parameters
planViewRange PlanViewRange
 The view range to validate.
Return Value
IList<PlanViewRangeError>
 List of enums describing any errors in the plan view range.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewPlan Class
Autodesk.Revit.DB Namespace